# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# YOLOv8-CGDP note:
# - Backbone: C2f_ConvFormerCGLU blocks.
# - Neck: DGAF feature fusion and PCLA enhancement.
# - Head: Detect_DyHead.

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  # n: [0.33, 0.25, 1024] # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.33, 0.50, 1024] # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768] # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 512] # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 512] # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs

# YOLOv8-CGDP backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f_ConvFormerCGLU, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f_ConvFormerCGLU, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f_ConvFormerCGLU, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f_ConvFormerCGLU, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9

# YOLOv8-CGDP head
head:
  - [[-1, 6], 1, DGAF, []] # 10 (P4/16)
  - [-1, 3, C2f, [512]] # 11

  - [[-1, 4], 1, DGAF, []] # 12 (P3/8)
  - [-1, 3, C2f, [256]] # 13

  - [[-1, 2], 1, DGAF, []] # 14 (P2/4)
  - [-1, 1, PCLA, [[3, 5, 7, 9]]] # 15
  - [-1, 3, C2f, [128]] # 16

  - [[-1, 13], 1, DGAF, []] # 17 (P3/8)
  - [-1, 3, C2f, [256]] # 18

  - [[-1, 11], 1, DGAF, []] # 19 (P4/16)
  - [-1, 3, C2f, [512]] # 20 

  - [[16, 18, 20], 1, Detect_DyHead, [nc, 128, 1]] # Detect(P3, P4, P5) 

